In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

In [8]:
df_data_original =pd.read_csv("DATA.CSV",index_col=0)
df_data_original.head(2).T

                                            0              1
Age                                        51             52
Attrition                                  No             No
BusinessTravel                            NaN            NaN
DailyRate                              684,0$         699,0$
Department                                NaN            NaN
DistanceFromHome                            6              1
Education                                   3              4
EducationField                            NaN  Life Sciences
employeecount                               1              1
employeenumber                          162,0          259,0
EnvironmentSatisfaction                     1              3
Gender                                      0              0
HourlyRate                                 51             65
JobInvolvement                              3              2
JobLevel                                    5              5
JobRole                    resEArch DIREcToR        ManAGeR
JobSatisfaction                             3              3
MaritalStatus                             NaN            NaN
MonthlyIncome                         19537,0        19999,0
MonthlyRate                              6462           5678
NUMCOMPANIESWORKED                          7              0
Over18                                      Y            NaN
OverTime                                   No            NaN
PercentSalaryHike                          13             14
PerformanceRating                         3,0            3,0
RelationshipSatisfaction                    3              1
StandardHours                             NaN            NaN
StockOptionLevel                            0              1
TOTALWORKINGYEARS                         NaN           34,0
TrainingTimesLastYear                       5              5
WORKLIFEBALANCE                           3,0            3,0
YearsAtCompany                             20             33
YearsInCurrentRole                        NaN            NaN
YearsSinceLastPromotion                    15             11
YEARSWITHCURRMANAGER                       15              9
SameAsMonthlyIncome                   19537,0        19999,0
DateBirth                                1972           1971
Salary                            1000000000$    1000000000$
RoleDepartament                           NaN            NaN
NUMBERCHILDREN                            NaN            NaN
RemoteWork                                Yes              1

In [9]:
df_data_original.columns

Index(['Age', 'Attrition', 'BusinessTravel', 'DailyRate', 'Department',
       'DistanceFromHome', 'Education', 'EducationField', 'employeecount',
       'employeenumber', 'EnvironmentSatisfaction', 'Gender', 'HourlyRate',
       'JobInvolvement', 'JobLevel', 'JobRole', 'JobSatisfaction',
       'MaritalStatus', 'MonthlyIncome', 'MonthlyRate', 'NUMCOMPANIESWORKED',
       'Over18', 'OverTime', 'PercentSalaryHike', 'PerformanceRating',
       'RelationshipSatisfaction', 'StandardHours', 'StockOptionLevel',
       'TOTALWORKINGYEARS', 'TrainingTimesLastYear', 'WORKLIFEBALANCE',
       'YearsAtCompany', 'YearsInCurrentRole', 'YearsSinceLastPromotion',
       'YEARSWITHCURRMANAGER', 'SameAsMonthlyIncome', 'DateBirth', 'Salary',
       'RoleDepartament', 'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')

##### Homogeneización del nombre de las columnas (en minúsculas)

In [10]:
df_data_copy= df_data_original.copy()

In [11]:
df_data_copy.head(2)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1

In [12]:
nuevas_columnas={columna:columna.lower() for columna in df_data_copy} #modificamos las columnas a minúsculas
df_data_copy.rename(columns= nuevas_columnas, inplace= True) #cambiamos las columnas antiguas por las homogeneizadas en el paso anterior (nuevas_columnas)

In [13]:
df_data_copy.head(2).T

                                            0              1
age                                        51             52
attrition                                  No             No
businesstravel                            NaN            NaN
dailyrate                              684,0$         699,0$
department                                NaN            NaN
distancefromhome                            6              1
education                                   3              4
educationfield                            NaN  Life Sciences
employeecount                               1              1
employeenumber                          162,0          259,0
environmentsatisfaction                     1              3
gender                                      0              0
hourlyrate                                 51             65
jobinvolvement                              3              2
joblevel                                    5              5
jobrole                    resEArch DIREcToR        ManAGeR
jobsatisfaction                             3              3
maritalstatus                             NaN            NaN
monthlyincome                         19537,0        19999,0
monthlyrate                              6462           5678
numcompaniesworked                          7              0
over18                                      Y            NaN
overtime                                   No            NaN
percentsalaryhike                          13             14
performancerating                         3,0            3,0
relationshipsatisfaction                    3              1
standardhours                             NaN            NaN
stockoptionlevel                            0              1
totalworkingyears                         NaN           34,0
trainingtimeslastyear                       5              5
worklifebalance                           3,0            3,0
yearsatcompany                             20             33
yearsincurrentrole                        NaN            NaN
yearssincelastpromotion                    15             11
yearswithcurrmanager                       15              9
sameasmonthlyincome                   19537,0        19999,0
datebirth                                1972           1971
salary                            1000000000$    1000000000$
roledepartament                           NaN            NaN
numberchildren                            NaN            NaN
remotework                                Yes              1

##### Limpieza y verificación de datos
- Modificar columnas categóricas a numéricas
- Estandarizar las etiquetas de las columnas categóricas (ej. gender, maritual status)
- Verificar duplicados
- Cambiar valores faltantes a nulos
- Dividir columnas y verificar su pertenencia (ej. "roledepartment" es una combinación de columnas "department" y "jobrole"?)
- Crear nuevas columnas (ej. de la columna "stock_option_level" crear unna columna con 2 categorías: "No" (stock_option_level = 0); "Yes" (stock_option_level = 1,2,3))
- Eliminar columnas redundantes y filas que sean duplicadas o en las que la mayoría de los valores de las columnas sean nulos

In [20]:
df_data_original.sample(5)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
108,46,No,NaN,"638,0$",NaN,1,3,Medical,1,NaN,3,0,40,2,3,HEalThCare REPreseNTAtive,1,Married,NaN,3142,2,NaN,Yes,13,"3,0",3,NaN,1,"21,0",5,"2,0",10,NaN,9,5,NaN,1977,1000000000$,NaN,NaN,False
582,27,No,non-travel,"210,0$",NaN,1,1,Marketing,1,"449,0",3,0,73,3,2,sales exEcutIVe,2,NaN,"6349,0",22107,0,Y,Yes,13,"3,0",4,NaN,1,NaN,0,NaN,5,NaN,1,4,"6349,0",1996,1000000000$,NaN,NaN,Yes
466,27,No,travel_rarely,"511,0$",Sales,2,2,NaN,1,"1898,0",1,1,89,4,2,SaLeS exeCuTIVe,3,Single,NaN,26997,0,Y,No,14,"3,0",2,NaN,0,"9,0",5,"2,0",8,NaN,0,7,NaN,1996,1000000000$,SaLeS exeCuTIVe - Sales,NaN,False
428,45,No,travel_rarely,"1038,0$",NaN,20,3,Medical,1,"1460,0",2,0,95,1,3,healtHCARe RePresenTATiVE,1,NaN,"10851,0",19863,2,Y,Yes,18,"3,0",2,"80,0",1,NaN,2,"3,0",7,NaN,0,7,"10851,0",1978,1000000000$,NaN,NaN,False
110,45,No,NaN,"194,0$",NaN,9,3,Life Sciences,1,"206,0",2,0,60,3,2,LaboRaTORY TechnICiAn,2,NaN,"2348,0",10901,8,Y,No,18,"3,0",3,NaN,1,"20,0",2,NaN,17,NaN,0,15,"2348,0",1978,1000000000$,NaN,NaN,Yes

In [21]:
# cambiamos de string a un integer
#las columnas a cambiar son :

#age
#totalworkingyears
#workinglifebalance
#daily rate (comas por puntos y quitarle el símbolo del dolar)
#hourly rate
#monthlyincome
#monthlyrate

def cambiar_comas (cadena):
    try:
        return float(cadena.replace (",", ".") )
    except:
        return np.nan

In [14]:
#def cambiar_comas(cadena):
    #try:
        #return float(cadena.replace("'","").replace(",",""))
   # except:
        #return np.nan

In [23]:
lista_columnas = ['totalworkingyears']
df_data_copy
for col in lista_columnas:
    df_data_copy[col] = df_data_copy[col].apply(cambiar_comas)
df_data_copy

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeecount,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,over18,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,sameasmonthlyincome,datebirth,salary,roledepartament,numberchildren,remotework
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,NaN,14,"3,0",1,NaN,1,NaN,5,"3,0",33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,NaN,No,11,"3,0",4,NaN,0,NaN,3,NaN,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518,1,Y,NaN,11,NaN,1,NaN,1,NaN,6,"3,0",16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163,1,NaN,NaN,12,"3,0",2,NaN,0,NaN,5,"2,0",9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560,0,NaN,No,18,"3,0",4,NaN,0,NaN,3,"3,0",8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952,4,NaN,No,13,NaN,4,NaN,2,NaN,3,"3,0",7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208,6,Y,NaN,13,"3,0",2,NaN,1,NaN,3,"3,0",8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

filas duplicadas

In [ ]:
filas_duplicadas = df_data_copy[df_data_copy.duplicated()]
cantidad_filas_duplicadas = len(filas_duplicadas)
cantidad_filas_duplicadas
df_sin_duplicados = df_data_copy.drop_duplicates()
df_sin_duplicados
df_sin_duplicados = df_data_copy.drop_duplicates()
print("Cantidad de filas antes de eliminar duplicados:“, len(df_data))
print("Cantidad de filas después de eliminar duplicados:“, len(df_sin_duplicados))
filas_eliminadas = len(df_data) - len(df_sin_duplicados)
print(“Cantidad de filas eliminadas por duplicados:“, filas_eliminadas)